# -*- coding: utf-8 -*-
"""
Created on Wed Feb  3 16:49:36 2021

@author: uldash

Python version: 3.9.1
"""

"""
Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности, каждую на отдельной строчке.

Формат входных данных
На вход программе подаются три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.

Примечание. Для считывания текста используйте команду input(), для печати текста на экране используйте команду print().

Sample Input 1:

I was
born
this way
Sample Output 1:

I was
born
this way
Sample Input 2:

I love
Python
so much
Sample Output 2:

I love
Python
so much
"""

var1 = input()
var2 = input()
var3 = input()
print(var1)
print(var2)
print(var3)
