# -*- coding: utf-8 -*-
"""
Created on Thu Jun  7 19:37:42 2018

@author: user
"""

#Список для создания словаря
A=[["Пушкин А.С.","Капитанская дочка"],["Чехов А.П.","Вишневый сад"],
   ["Толстой Л.Н.","Война и мир"]]
writers=dict(A)
print("Словарь:")
print(writers)
print("Чехов написал пьесу:",writers["Чехов А.П."])
#Изменяем значение элемента словаря
writers["Чехов А.П."]="Каштанка"
print("Словарь после изменеия элемента:")
print(writers)

writers["Достоевский Ф.М."]="Преступление и наказание"
print("Словарь после добавления элемента:")
print(writers)

print("Авторы и их произведения")
for s in writers.keys():
    print("Автор:",s)
    print("Произведение:",writers[s])
    print()

lights=dict(красный="движение запрещено",желтый="всем внимание",
            зеленый="Движение разрешено")
print("новый словарь:")
print(lights)
color="зеленый"
print("Если горит",color,"свет, то ",lights[color]+"!")
print()

girls={(90,60,90):"Света",(85,65,89):"Юля",(92,58,91):"Нина"}
print("Еще один словарь:")
print(girls)
params=(90,60,90)
print(girls[params]+":",params)

A=["1","2","3"]
print(A.__class__,A.__sizeof__())
B={1:"1",2:"2",3:"3"}
print(B.__class__,B.__sizeof__())
C={'1':"1",'2':"2",'3':"3"}
print(C.__class__,C.__sizeof__())

D={1:(1,1)}
E=[D[1],(2,2)]
D[1]=E
print(D)