# -*- coding: utf-8 -*-
"""
Created on Wed Feb  3 19:54:00 2021

@author: uldash

Python version: 3.9.1
"""

"""
Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).

Примечание. Используйте необязательный параметр sep.

Sample Input:

Sample Output:

I***like***Python
"""

print('I', 'like', 'Python', sep='***')
